{
  "add_prefix_space": true,
  "backend": "tokenizers",
  "bos_token": "[CLS]",
  "cls_token": "[CLS]",
  "do_lower_case": true,
  "eos_token": "[SEP]",
  "is_local": false,
  "keep_accents": false,
  "local_files_only": false,
  "mask_token": "[MASK]",
  "model_max_length": 1000000000000000019884624838656,
  "pad_token": "[PAD]",
  "sep_token": "[SEP]",
  "tokenizer_class": "AlbertTokenizer",
  "trim_offsets": true,
  "unk_token": "[UNK]"
}
